print('Задача 7. Наибольшая сумма цифр')
print('--------------------------')
# Вводится N чисел. 
# Среди натуральных чисел, которые были введены, 
# найдите наибольшее по сумме цифр. Выведите на экран это число и сумму его цифр.


print('--------------------------')