print('Задача 6. Сумма факториалов')
print('--------------------------')
# Напишите программу,
# которая запрашивает у пользователя число N
# и находит сумму факториалов 1! + 2! + 3! +... + N! 


print('--------------------------')